[
  {"name": "MATT DESPILIA", "schedule": [{"day": "Wednesday", "start": "18:00", "end": "19:00"}], "bio": "Matt Despilia helps you enjoy sunshine filled latin house sounds and smooth, soulful vocal tracks from across the decades. With a diverse cross sections of influences including bossa nova, underground disco and soul, he is sure to delight you with some forgotten gems in the mix. His flagship radio show, 'The House Party' broadcasts live every Wednesday on Trax Radio UK from 6pm or you can catch up almost everywhere, including Soundcloud, Mixcloud, Amazon Music, Apple Podcasts and YouTube and for an extra twist on the modern dj genre, Matt plays all his shows on vinyl! To contact him either email despilia@hotmail.com or message through the socials.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/05/matt.jpg"},
  {"name": "DJ MENACE", "schedule": [{"day": "Wednesday", "start": "19:00", "end": "21:00"}], "bio": "2hrs of uplifting funky vibes, pianos, wave your hands in the air wailing women type stuff!", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/menace.jpg"},
  {"name": "Simon Bradbury", "schedule": [{"day": "Monday", "start": "19:00", "end": "20:00"}], "bio": "Simon knew from an early age he'd always be involved with music. When he was only 2 years old he refused to sleep in a bed, instead choosing to sleep in a big bass drum his old grandad had given him at xmas. As Simon grew so did his love of drums and bass, in his teens Simon travelled to Latvia, home of breakbeat where he discovered a love for the Amen Break and bought it back to the UK where it soon spawned a million tracks and launched a movement that would last decades. Having bought breaks to the UK Simon didn't stop there and was soon introducing flute trance to Birmingham, as well as some Hungarian trip hop flavours to Brighton that spawned numerous number 1 hits. Disillusioned with the lack of praise he was getting for his musical influences Simon decided to launch the UKs oldest independent music station, with live DJs from 18:00 onwards every day of the week and has already set the ball rolling on making Trax one of the biggest influences on the music scene with live events and shows planned for 2024 and beyond. Keep it Trax", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/simon-1.jpg"},
  {"name": "DJ HICKY", "schedule": [{"day": "Friday", "start": "22:00", "end": "23:00"}], "bio": "I started DJing as a bit of a fluke really. As a Glass collector in one of Swansea's Biggest Clubs at the time, Sloanes Night Club in the late 80's, I helped The Resident DJ out and took over the Decks for 10 minutes. That was it for me, I was hooked. From there I worked hard as a Mobile DJ and got a Residency at a Busy Music Bar plus working the crowd in the Club I started at Sloanes, from time to time. Things grew and I became a DJ in several Clubs in South Wales. Quids Inn Both in Swansea and Newport, Poo Na Na Club and covered a couple of events in Ibiza and Mallorca and couple of Radio Stations. I stop for a few years (Family life etc) But back in 2018 I got the Technics out, dusted them off, bought a cheap Second hand controller (I'd never used Digital Before) and started up again. I was looking for a reputable Radio Station at this turned out to be TRAX RADIO UK and I've never looked back since. Equipment has now become better and I play off a Pioneer XDJ XZ and still use my Technics too from time to time. My Music Genre varies from House, NuDisco, Deep House, Funk and Disco But never forgetting my Roots and playing Club Classics from the 90's", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/dj-hickey.jpg"},
  {"name": "MIX5TA", "schedule": [{"day": "Monday", "start": "21:00", "end": "22:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/mix5ta.jpg"},
  {"name": "MARK JOPO", "schedule": [{"day": "Friday", "start": "21:00", "end": "22:00"}], "bio": "Mark Jopo (aka: Mark Jay) from Liverpool. Started DJ'ing in 1990, on the back of clubbing in Quadrant Park (Liverpool) and Park Hall (Chorley) when weekends simply rolled one night into another. He first DJ'd at house parties and club events, in fields and gardens, wherever he could set-up a pair of decks and a PA..! His first club residency was in 'The 174 Club' in Skem, DJ'ing with lots of big names including Mike Knowler, DJ Vertigo and Stu Allen. Following this he went onto play the bar and club circuit around Liverpool and the North-West for many years. Mark has been fortunate enough to play and hold residencies in venues such as Republik, AXM Southport, Reminisce, Modo, Arena, Baa Baa, Mood Indigo and the legendary G-Bar; regularly playing with the likes of Dave Graham, John Cotton, Neil James and Dave Booth. DJs who have inspired him include John Kelly, Andy Carroll, Mike Knowler, Steve Proctor, Carl Cox, Tony de Vit, DJ Vertigo, DJ Whelly, Paul Bleasdale, John Pleased Wimmin, John Cotton (this list goes on…) These days mark plays various styles of house music ranging from funky, chunky, vocal, piano, techno, trance hard house and of course old Skool. If it's chunky funky vocals, piano house or Old Skool, then Trax Radio Friday nights is the place to be.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/09/jopo.png"},
  {"name": "Tim Bee", "schedule": [
    {"day": "Monday", "start": "09:00", "end": "10:00"},
    {"day": "Wednesday", "start": "09:00", "end": "10:00"},
    {"day": "Friday", "start": "09:00", "end": "10:00"},
    {"day": "Monday", "start": "18:00", "end": "19:00"},
    {"day": "Saturday", "start": "10:30", "end": "11:30"}
  ], "bio": "Tim Bee cut his DJ teeth working in Manchester nightclubs in the late 90s. Playing sold out nights and bringing a brand of Melodic Trance that had erupted in '98 when he was in Ibiza! He progressed to plying massive student nights alongside many A-list DJs inc Judge Jules, Dave Pearce, Kryder, Stu Allan and many more! As his reputation grew, he was invited to appear at the big club nights, the pinnacle of which being the Hacienda, along with Sankeys Soap, Manchester Academy, the Ritz, Joshua Brooks, Dry Bar, Glass, Leeds love parade and many more. In early 2000 he was invited to cover one Saturday night at Mega Club Lucid in the Manchester Printworks but that lead to Saturday night residency for several years playing regularly to 1000+ ravers. Coupled with playing weekly Friday nights at K2 club at MMU, Tim Bee was a well-known face on the Manchester club scene! In 2003 he had a hiatus for some years but in 2020 when Lockdown ＃1 struck, he realised he could broadcast his sets over the internet from his home studio to some of the ever increasing number of online Radio stations. Expect melodic and tech house music along with piano anthems and a nod to the Old Skool. Tim has found a niche within Trax Radio, not only presenting many shows each week including a breakfast show but also as part of the Production team that brought together the station's first live events during 2023. He has enjoyed playing at every one so far and is currently looking forward to returning to The Jug in Newcastle-u-Lyme for the first event of 2024.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/timbee.jpg"},
  {"name": "Jimmy Trane", "schedule": [{"day": "Monday", "start": "22:00", "end": "23:00"}], "bio": "A Journey Through Deep Melodic Sounds. Jimmy Trane is a prominent figure in the world of deep melodic tech house. His journey into electronic music began in 1997 when he first experimented with his first pair of Technic 1200 turntables. Starting out in Vail, Colorado, his passion for DJing flourished, eventually leading him to San Francisco, where he immersed himself in the city's dynamic electronic music scene. Trane's unique sound, blending organic deep melodic rhythms with touches of techno, quickly earned him recognition. His career truly gained momentum after his return to Miami in 2009, where he became a vital part of the city's underground dance music culture. Trane's style is known for its smooth, energetic flow, intricate layering, and hypnotic beats that captivate audiences. His dedication to the craft of DJing and his deep attention to musical detail have made him a favorite among fans and a respected figure in the industry. A key highlight of his career was his seven-year residency at Segafredo L'Originale in Miami, as well as his memorable guest appearances at the Electric Pickle, one of the city's most iconic underground venues. These gigs solidified his place in Miami's underground scene, earning him a loyal following. Trane's ability to blend deep melodic tech house with elements of progressive house and techno became his signature, making him a sought-after DJ both locally and nationally. Jimmy Trane has shared the stage with industry legends like Keoki in Vail and more recently Nii Tei and the Coconut Groove Crew, drawing inspiration from figures like Lee Burridge, James Zabiela, and the legendary duo Sasha & Digweed. His performances have taken him to renowned venues in Aspen, New York, Las Vegas, California, and beyond, constantly expanding his reach. Currently based in Hollywood, Florida, Trane continues to innovate and push boundaries in the electronic music scene. Whether spinning in Miami's underground clubs or performing at high-profile events across the U.S., his sound remains fresh, dynamic, and unmistakably his own. His evolution as an artist and DJ ensures that his music resonates with audiences around the world, delivering unforgettable musical experiences wherever he plays. Follow Jimmy Trane on social media for updates and exclusive mixes: Instagram: @fr8trane, SoundCloud: https://soundcloud.com/jimmytrane", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/11/jimmytrane.png"},
  {"name": "DJ GARY HILL", "schedule": [
    {"day": "Monday", "start": "18:00", "end": "19:00"},
    {"day": "Saturday", "start": "19:00", "end": "20:00"}
  ], "bio": "From a misspent youth in the Acid House days in Sunny Manchester, raving, misbehaving and DJ'ing at parties, bars in the Village, Club spots at Millionaires and elsewhere to a sedate middle life. A career with a camera never lost the love. Now back heavily into the house scene playing everything from Disco to Melodic to Tech House. You never know what is coming next, but it will have a 4/4 beat.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/09/gary.jpg"},
  {"name": "STEPHEN MARSH", "schedule": [{"day": "Saturday", "start": "21:00", "end": "22:00"}], "bio": "As a DJ and producer specializing in Techno, Stephen is passionate about creating and sharing hard hitting music that ignites the dance floor and captivating an audience. With a curated selection of tracks, uncommon transitions, and mixing skills, he has led his own unique path. Whether he is performing on the decks or crafting new tracks in the studio, he is constantly seeking to push the boundaries of genres and explore new creative avenues.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/08/stephenmarsh.jpg"},
  {"name": "Scotty C", "schedule": [{"day": "Tuesday", "start": "18:00", "end": "19:00"}], "bio": "Scotty C is a Deep House, Vocal & Tech House DJ from Dundee Scotland. Home of Fat Sams, The Rhumba & of course new world superstar DJ Hannah Laing, who's smashing it. He started his DJ journey in about 1990 in around Leeds and played in the illegal blues clubs around Chapeltown, then got onto the local pirate station 105.3FM, RCR Radio where I had my own show and had a couple of midweek nights at the Music Factory, known best as B2B. After a break off the decks Scotty C Really wanted to start again and learn digital, so he went full in and rediscovered his love and taste for DJing again last year. Scotty C takes pride in his DJing and enjoys working on his sets to his best ability to bring you that seamlessly blend of two tracks to create another tune and loves to see people enjoying and dancing to his music. Scotty takes influences from Easygroove, Early Sasha, Top Buzz & of course Carl Cox. You can catch Scotty C every Friday 6-8pm on Trax Radio UK", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/scotty.jpg"},
  {"name": "JEFF GOMEZ", "schedule": [{"day": "Friday", "start": "23:00", "end": "00:00"}], "bio": "Since the age of 16, I've been involved with music. Throwing parties, playing parties, running a record shop, booking gigs for a stable of DJ's in the USA. No hustle was too big or too small. Still, nothing beats moving a dancefloor. No genre is off limits. Catch myself along with a roster full of amazing talent @ TRAX RADIO UK seven days a week. Check the website for the full schedule. I'll be playing every Friday 6pm EST (23:00 UK)", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/09/gomez.jpg"},
  {"name": "DJ SIDWAYNE", "schedule": [
    {"day": "Thursday", "start": "21:00", "end": "22:00"},
    {"day": "Saturday", "start": "18:00", "end": "19:00"}
  ], "bio": "I attended the Top Rank in Hanley, Stoke on Trent, aged just 10 in 1970. Northern Soul was the the first club music I ever heard, and I adored it. Seeing the spectacular dancing just blew my mind. When I hear any of those tunes today, I'm transported right back there. I moved through the Jazz-Funk era, purchasing loads of vinyl, which I still have and deejay that stuff. It stirred an interest in Jazz and proper Funk, which I am enormously passionate about. I also was around for the birth of Hip-Hop, and took in loads of Reggae too. Getting married young (19) and having a kid (20), meant I dropped away from music for a bit but, never lost my enthusiasm. After a long bout of ill health, I am making a comeback. I now deejay locally, specialising in the above genres and a bit of baggy and more. I love Street deejaying! I am now running a record stall in Stoke Market, and have got a gig on Trax Radio.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/08/sid.jpg"},
  {"name": "DJ R3-P3T3", "schedule": [{"day": "Sunday", "start": "19:00", "end": "20:00"}], "bio": "A love for music from an early age, Jack gave Pete the groove when he opened his mind properly for the first time in the 90's. Inspired by Sasha & Digweed, Carl Cox, Boy George, Sanjay Patel owner and headliner DJ of Sin City, Pete would be seen out clubbing in the Stoke on Trent clubs; The Academy aka The Void (Platinum & Golden), Leftbank (Sin City), & The Place (2 pure Thurs night). He met his wife, Rach, dancing on a podium together at The Academy in September 1995, then chilling either at Dread Heads or the Sunshine Coffee Shop in Hanley, Stoke-on-Trent. With a new raving partner in crime, they'd scour mixmag for nights outside of town, travelling to Que Club, Cream, Progress, UK Midlands, as far as Ibiza for the DJs of the time. The pull of music was strong with him so Pete wanted to try to play the kind of music and tunes that he liked himself, so he bought his first set of decks (Technics 1210's) in October 2001 and did his first mix playing at his mates farm house rave NYE 2001. In 2002 he run a local night with his brother in law called 92 Decibels with some young budding DJs in Baddeley Green, holding nights in local bowling clubs and pubs to do it themselves. He moved through the genres of club space fluidly as music evolved on the scene, which led to a vinyl addiction, getting his fix in Global Groove records on a Friday afternoon with the help of local DJ and friend Pete Bromley. His vinyl collection ranges from old skool, trance, hard house, funky & tech house, 90s techno, tribal and psytrance along with a large collection of Hoxton Whores vinyl which were hand picked for sets that he played at his own night SUM (Stoke underground music) held at Club Zero, Rocked at Bar360, and Revolution. The digital door was unlocked in 2018 where Santa bought Pete a Denon digital interface for being good that year. He soon upgraded to a Pioneer controller. Through a close mutual friend and DJ, he was introduced to Trax and joined the fam in November 2023, where he now plays every Sunday night 7-8pm. He continues on his journey with his music and has a deep respect for all of the support he receives from being a part of something that's up and coming and is going to have a massive impact on the Stoke-on-Trent dance scene. That something is Trax Radio UK. PLUR – Peace, Love, Unity & Respect to all.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/repete.jpg"},
  {"name": "DJ CHRIS FRESH", "schedule": [{"day": "Sunday", "start": "18:00", "end": "19:00"}], "bio": "Chris Fresh is the next chapter in this Musician/Producer and Singer/Songwriter combination. Chris (aka) DefusionUK who is an established producer of Dance, Trance, Club tracks and has collaborated with various artists in recent years. Prior to having his tracks signed he has had many 8 star track's and also lots of featured tracks of the week, plus remixes, and mega-mixes on a website dedicated to dance music of all style's. Following many tracks signed by various dance music record labels. Continually developing his original style most recently with Singer-Songwriter Julia Dowler also from the UK. Julia Dowler is primarily an acoustic artist. Writing and performing songs on her acoustic guitar. She too has worked with other musicians/songwriters over recent years. Sometimes writing music to other artists lyrics. Collaborating with other Dance and Contemporary music producers, using her own songwriting skills, whilst still creating original acoustic tracks. Some tracks have been played on Radio stations in Australia, USA and the UK. Most recently however focusing on the tracks produced by Chris of DeFusionUK.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/fradley.jpg"},
  {"name": "DJ MANIC", "schedule": [{"day": "Wednesday", "start": "21:00", "end": "22:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2025/01/MANIC.png"},
  {"name": "DJ N-SANE", "schedule": [{"day": "Tuesday", "start": "21:00", "end": "22:00"}], "bio": "Hi i'm Lisa swinnerton also known as \"DeeJay N-SaNe\" I started downloading house and electro/Dirty house back in 2007 and making CDs for us all Listen to at parties. My fave was DJ was Fake Blood & Solid Groove. I loved going to reckless in Cocos in Hanley and Sugarmill I got inspired to start DJing myself in 2009 as a bedroom DJ making my own mashups mixes. I then had my first proper hour slot at the factory in Hanley 2010. Then started doing my own night at bar360 Hanley. Floorfillers Friday & electro house on a Saturday. I then took over the bar360 breakfast club every weekend in 2013 till 2018. In 2014 I got myself logic and started producing my own music. Since then I've been DJing in pubs around Cheadle and stoke.", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/08/nsane.jpg"},
  {"name": "STEVIE B", "schedule": [
    {"day": "Monday", "start": "20:00", "end": "21:00"},
    {"day": "Tuesday", "start": "19:00", "end": "20:00"}
  ], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"},
  {"name": "BRIAN KIDD", "schedule": [{"day": "Friday", "start": "18:00", "end": "19:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"},
  {"name": "MIKE LEADY", "schedule": [{"day": "Friday", "start": "19:00", "end": "20:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"},
  {"name": "DJ JAYCEE", "schedule": [{"day": "Saturday", "start": "20:00", "end": "21:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"},
  {"name": "CHRIS JACKSON", "schedule": [{"day": "Thursday", "start": "19:00", "end": "20:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"},
  {"name": "DJ PADDY", "schedule": [{"day": "Thursday", "start": "18:00", "end": "19:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"},
  {"name": "DJ SIR CHARLEZ", "schedule": [{"day": "Thursday", "start": "22:00", "end": "23:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"},
  {"name": "Steve B", "schedule": [{"day": "Sunday", "start": "21:00", "end": "22:00"}], "bio": "", "image": "https://trax-radio-uk.com/wp-content/uploads/2024/02/placeholder.jpg"}
] 